Reports/БазаРаспределенияПроизводственныхРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>БазаРаспределенияПроизводственныхРасходов</Name>
		</Properties>
	</Report>
</MetaDataObject>

Enums/НазначениеПравилРаспределенияРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>НазначениеПравилРаспределенияРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РаспределениеСтатейРасходовПоПодразделениям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеСтатейРасходовПоЭтапамПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеМатериаловИРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеРасходовНаФинансовыйРезультат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеРасходовНаСебестоимостьТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеРасходовНаРБП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеРасходовНаОВЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеРасходовНаСебестоимостьПроизводства</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/БазаРаспределенияПроизводственныхРасходов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область КомандыПодменюОтчеты

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
// Возвращаемое значение:
//	СтрокаТаблицыЗначений - описание команды отчета.
Функция ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт
	
	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.БазаРаспределенияПроизводственныхРасходов) Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		
		КомандаОтчет.Идентификатор               = Метаданные.Отчеты.БазаРаспределенияПроизводственныхРасходов.ПолноеИмя();
		КомандаОтчет.Менеджер                    = "Отчет.БазаРаспределенияПроизводственныхРасходов";
		КомандаОтчет.Представление               = НСтр("ru = 'Распределение расходов'");
		
		КомандаОтчет.МножественныйВыбор          = Ложь;
		КомандаОтчет.Важность                    = "Обычное";
		КомандаОтчет.РежимЗаписи                 = "Проводить";
		КомандаОтчет.КлючВарианта                = "РаспределениеРасхода";
		//++ Локализация
		КомандаОтчет.ФункциональныеОпции         = "ПартионныйУчетВерсии22";
		//-- Локализация
		
		Возврат КомандаОтчет;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возращает массив назначений документа РаспределениеПрочихЗатрат, которые поддерживает отчет
//
// Возвращаемое значение:
//   Массив из ПеречислениеСсылка.НазначениеПравилРаспределенияРасходов
//
Функция ПоддерживаемыеТипыНазначенийРаспределения() Экспорт 

	Результат = Новый Массив;
	
	Результат.Добавить(Перечисления.НазначениеПравилРаспределенияРасходов.РаспределениеРасходовНаСебестоимостьПроизводства);
	Результат.Добавить(Перечисления.НазначениеПравилРаспределенияРасходов.РаспределениеСтатейРасходовПоЭтапамПроизводства);
	Результат.Добавить(Перечисления.НазначениеПравилРаспределенияРасходов.РаспределениеРасходовНаФинансовыйРезультат);
	Результат.Добавить(Перечисления.НазначениеПравилРаспределенияРасходов.РаспределениеРасходовНаОВЗ);
	
	Возврат Результат;

КонецФункции

#КонецОбласти
		
#КонецЕсли
